IDENTIFICATION DIVISION.
PROGRAM-ID. WELCOME.

ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT OUTPUT-FILE ASSIGN TO 'welcome.json'
      ORGANIZATION IS LINE SEQUENTIAL.          

DATA DIVISION.
   FILE SECTION.

   FD OUTPUT-FILE.
   01 JSON-TEXT PIC A(99).

   WORKING-STORAGE SECTION.
   01 WS-MESSAGE PIC X(21) VALUE 'Welcome to Orquestra!'.

PROCEDURE DIVISION.

   OPEN OUTPUT OUTPUT-FILE.
       MOVE '{' to JSON-TEXT.
       WRITE JSON-TEXT.
       MOVE '  "schema" : "message",' to JSON-TEXT.
       WRITE JSON-TEXT.
       STRING '  "message": "' DELIMITED BY SIZE
              WS-MESSAGE DELIMITED BY SIZE
              '"' DELIMITED BY SIZE
         INTO JSON-TEXT.
       WRITE JSON-TEXT.
       MOVE '}' TO JSON-TEXT.
       WRITE JSON-TEXT.
   CLOSE OUTPUT-FILE.

STOP RUN.